In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import numpy as np
import scipy.stats as st

In [3]:
sales=pd.read_csv('supermarket_sales.csv')
sales

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,692-92-5582,B,Mandalay,Member,Female,Food_and_beverages,54.84,3,8.226,172.746,2/20/2019,13:27,Credit card,164.52,4.761905,8.226,5.9
1,351-62-0822,B,Mandalay,Member,Female,Fashion_accessories,14.48,4,2.896,60.816,6/2/2019,18:07,Ewallet,57.92,4.761905,2.896,4.5
2,529-56-3974,B,Mandalay,Member,Male,Electronic_accessories,25.51,4,5.102,107.142,9/3/2019,17:03,Cash,102.04,4.761905,5.102,6.8
3,299-46-1805,B,Mandalay,Member,Female,Sports_and_travel,93.72,6,28.116,590.436,1/15/2019,16:19,Cash,562.32,4.761905,28.116,4.5
4,319-50-3348,B,Mandalay,Normal,Female,Home_and_lifestyle,40.30,2,4.030,84.630,11/3/2019,15:30,Ewallet,80.60,4.761905,4.030,4.4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,886-18-2897,A,Yangon,Normal,Female,Food_and_beverages,56.56,5,14.140,296.940,3/22/2019,19:06,Credit card,282.80,4.761905,14.140,4.5
996,745-74-0715,A,Yangon,Normal,Male,Electronic_accessories,58.03,2,5.803,121.863,10/3/2019,20:46,Ewallet,116.06,4.761905,5.803,8.8
997,727-02-1313,A,Yangon,Member,Male,Food_and_beverages,31.84,1,1.592,33.432,9/2/2019,13:22,Cash,31.84,4.761905,1.592,7.7
998,347-56-2442,A,Yangon,Normal,Male,Home_and_lifestyle,65.82,1,3.291,69.111,2/22/2019,15:33,Cash,65.82,4.761905,3.291,4.1
999,849-09-3807,A,Yangon,Member,Female,Fashion_accessories,88.34,7,30.919,649.299,2/18/2019,13:28,Cash,618.38,4.761905,30.919,6.6

In [4]:
sales.columns

Index(['Invoice ID', 'Branch', 'City', 'Customer type', 'Gender',
       'Product line', 'Unit price', 'Quantity', 'Tax 5%', 'Total', 'Date',
       'Time', 'Payment', 'cogs', 'gross margin percentage', 'gross income',
       'Rating'],
      dtype='object')

In [5]:
df=pd.DataFrame(sales, columns = ['Gender', 'Total'])
df

     Gender    Total
0    Female  172.746
1    Female   60.816
2      Male  107.142
3    Female  590.436
4    Female   84.630
..      ...      ...
995  Female  296.940
996    Male  121.863
997    Male   33.432
998    Male   69.111
999  Female  649.299

[1000 rows x 2 columns]

In [10]:
df.groupby('Gender').mean()

             Total
Gender
Female  335.095659
Male    310.789226

# Hypothesis testing

### H0: On Average, Female spend more than Male customers in the market
### H1: On Average, Female spend less than or equal to Male customers in the market

In [50]:
sample=df.sample(200)
sample

     Gender     Total
923    Male  680.6100
909  Female  182.9100
748  Female  723.2400
120    Male  128.4255
697    Male  391.4190
..      ...       ...
332  Female   80.2200
599    Male  287.9100
646    Male  176.9250
6      Male   69.7200
601    Male  455.1225

[200 rows x 2 columns]

In [51]:
sample.Total.mean()

309.6140775000001

## z test

In [52]:
#standard deviation of the population
sd=np.std(sample['Total'])
sd

241.83453333309896

In [53]:
sample.std()

C:\Users\aravi\AppData\Local\Temp\ipykernel_40532\1487051019.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  sample.std()

Total    242.441396
dtype: float64

In [54]:
xbar=sample.Total.mean()
mu=df.Total.mean()
n=200 #sample size
alpha=0.05

In [55]:
xbar

309.6140775000001

In [56]:
mu

322.96674899999965

In [57]:
zvalue=(xbar-mu)/(sd/np.sqrt(n))
zvalue

-0.7808450211369179

In [58]:
z_critical = st.norm.ppf(alpha)  #One tail Test
z_critical

-1.6448536269514729

In [59]:
if (zvalue<z_critical and abs(zvalue)> abs(z_critical)):
  print("Reject Null Hypotheisis")
else:
  print("Fail to reject Null Hypothesis")

Fail to reject Null Hypothesis

## Test using p value

In [22]:
p_val = (1 - st.norm.cdf(abs(zvalue)))
p_val

0.49999999999998834

In [23]:
#comparing with alpha value
if p_val<alpha:
  print("Reject Null Hypotheisis")
else:
  print("Fail to reject Null Hypothesis")

Fail to reject Null Hypothesis

### Hence we cannot reject the null hypothesis, therefore we can conclude that female spend more than male on average

## T test

In [33]:
tsample=df.sample(30)
tsample

     Gender     Total
36     Male  944.6220
60   Female  241.4580
456  Female  173.2080
22     Male  318.1080
27     Male  608.2020
956    Male  271.2780
90     Male  352.5795
481    Male  937.8180
774    Male  523.8450
601    Male  455.1225
137  Female   20.1075
398    Male  323.1480
617  Female  131.9220
66     Male  146.2230
632    Male  888.4050
21   Female  520.4115
323  Female   26.7225
530    Male  293.1390
533  Female  193.4625
837    Male  728.1120
6      Male   69.7200
558    Male  153.0480
78     Male  310.0440
940    Male   95.8650
567  Female  317.2260
222    Male  196.1400
62     Male   93.2925
363  Female  198.9960
182  Female  356.3280
879    Male  764.1900

In [34]:
t_sd=np.std(tsample['Total'])
t_sd

265.69802620968505

In [35]:
xbar=tsample.Total.mean()
mu=df.Total.mean()
n=30
alpha=0.05

In [36]:
print('xbar :', xbar)
print('mu :', mu)

xbar : 355.09144999999995
mu : 322.96674899999965

In [37]:
n = 25
degrees_of_freedom = n-1
t = (xbar - mu)/(t_sd / np.sqrt(n))
t

0.6045340542847681

In [38]:
t_critical = st.t.ppf(alpha, degrees_of_freedom)
t_critical

-1.7108820799094282

In [39]:
if (t > t_critical):
    print("Null hypothesis cannot be rejected")
else:
    print("Reject null hypothesis")

Null hypothesis cannot be rejected

### Both Z test and T test suggest the same ie., The Null Hypothesis cannot be rejected.
### Thus concluding that, female customers spend more than male customers on average